Revit 2027 API
ModelCurveArrArray.ReverseIterator Method
Retrieve a backward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ModelCurveArrArrayIterator ReverseIterator()
Public Overridable Function ReverseIterator As ModelCurveArrArrayIterator
public:
virtual ModelCurveArrArrayIterator^ ReverseIterator()
abstract ReverseIterator : unit -> ModelCurveArrArrayIterator
override ReverseIterator : unit -> ModelCurveArrArrayIterator
Return Value
ModelCurveArrArrayIterator
Returns a backward moving iterator to the array.
See Also
Reference
ModelCurveArrArray Class
Autodesk.Revit.DB Namespace